app/controllers/admin/admin_controller.rb

  def index

    if(params[:choice]=="4")
      #logger.debug("choice 444444")
      @user_payment = User.order("user_first_name").paginate :page =>params[:page] || 1, :per_page =>params[:per_page]|| 6

      respond_to do |format|
        format.js { render "admin/admin/payments/data"}
      end

    elsif (params[:choice]=="3")
      #logger.debug("choice 333333")
      @abuse_report = MessageAdmin.joins("JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id").order("user_first_name").paginate :page =>params[:page] || 1, :per_page =>params[:report_per_page] || 6

      respond_to do |format|
        format.js { render "admin/admin/abuse_reports/data"}
      end
    else
      #logger.debug("else part no 333333 44444444")
    	@user_payment = User.order("user_first_name").paginate :page =>1, :per_page =>6
      @abuse_report = MessageAdmin.joins("JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id").order("user_first_name").paginate :page =>1, :per_page =>6
      @pricing = SubscriptionPlan.order(:id)

      @abuse_report.each do |variable|
---
SELECT "users".* FROM "users" ORDER BY user_first_name LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "users"
SELECT "message_admins".* FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id ORDER BY user_first_name LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id
SELECT "subscription_plans".* FROM "subscription_plans" ORDER BY id
SELECT "offers".* FROM "offers" ORDER BY created_at DESC LIMIT 5

  def payment_search
    if(params[:payment_basic_search]=="false" && params[:payment_advanced_search]=="false")
      # index sort_by and pagination part

      case params[:sort_by].to_i
      when 1
        @user_payment = User.order("user_first_name")
      when 2
        @user_payment = User.order("user_last_name")
      when 3
        @user_payment = User.joins("JOIN subscriptions on users.id=subscriptions.user_id JOIN subscription_plans on subscriptions.subscription_plan_id=subscription_plans.id JOIN payments on payments.user_id=users.id").order("payments.transaction_amount-payments.paid_amount")
      when 4
        @user_payment = User.joins("JOIN subscriptions on users.id=subscriptions.user_id").order("subscriptions.subscription_start_date")
      when 5
        @user_payment = User.joins("JOIN subscriptions on users.id=subscriptions.user_id JOIN subscription_plans on subscriptions.subscription_plan_id=subscription_plans.id").order("subscription_plans.subscription_name")
      end

      @user_payment = @user_payment.paginate :per_page=> params[:per_page].to_i|| 6, :page=>params[:page] || 1
---
SELECT "users".* FROM "users" JOIN subscriptions on users.id=subscriptions.user_id JOIN subscription_plans on subscriptions.subscription_plan_id=subscription_plans.id JOIN payments on payments.user_id=users.id WHERE (CONCAT(users.user_first_name, ' ', users.user_last_name) ilike '%%' OR
SELECT "payments".* FROM "payments" WHERE "payments"."user_id" = 145 LIMIT 1
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = 145 LIMIT 1
SELECT COUNT(*) FROM "users" JOIN subscriptions on users.id=subscriptions.user_id JOIN subscription_plans on subscriptions.subscription_plan_id=subscription_plans.id JOIN payments on payments.user_id=users.id WHERE (CONCAT(users.user_first_name, ' ', users.user_last_name) ilike '%%' OR

  def abuse_reports
  	#logger.debug(params[:message_admin])

    if(params[:report_basic_search]=="false" && params[:report_advanced_search]=="false")

      # index sort_by and per_page part
      @abuse_report = MessageAdmin.joins("JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id")
      case params[:report_sort_by].to_i
      when 1
        #@abuse_report = MessageAdmin.joins("JOIN offers ON offers.id = message_admins.offer_id JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id").order("lower(artists.artist_name) asc")
        @abuse_report = @abuse_report.order("user_first_name")
      when 2
        @abuse_report = @abuse_report.order("user_last_name")
      when 3
        @abuse_report = @abuse_report.order("created_at")
      when 4
        @abuse_report = @abuse_report.order("is_solved desc")
      when 5
        @abuse_report = @abuse_report.order("is_solved asc")
      end

      @abuse_report = @abuse_report.paginate :per_page=> params[:report_per_page].to_i|| 6, :page=>params[:page] || 1
---
SELECT "message_admins".* FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id WHERE (CONCAT(user_first_name, ' ', user_last_name) ilike '%Sudipta%' OR
SELECT "message_admins".* FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id ORDER BY user_first_name LIMIT 12 OFFSET 0
SELECT "message_admins".* FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id ORDER BY user_last_name LIMIT 6 OFFSET 0
SELECT "message_admins".* FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id ORDER BY created_at LIMIT 6 OFFSET 0
SELECT "message_admins".* FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON artworks.offer_id = offers.id JOIN artists ON artworks.artist_id = artists.id ORDER BY is_solved desc LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "message_admins" JOIN users ON message_admins.user_id = users.id JOIN offers ON message_admins.offer_id = offers.id JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id WHERE (CONCAT(user_first_name, ' ', user_last_name) ilike '%Sudipta%' OR