app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "messages" WHERE "messages"."offer_id" = 83
SELECT COUNT(*) FROM "offers" WHERE (offer_end_date > '2013-06-20 09:31:02.637881') AND (offer_end_date < '2013-06-21 09:31:02.638151')
---
    if sort_by == "Most Clicked"
      @offers = Offer.where("offer_status=true").order("offers.offer_popularity desc")
    elsif sort_by == "Most messages"
      @offers = Offer.where("offer_status=true").find(:all, :include => :messages).sort_by { |p| p.messages.size}

SELECT MAX("messages"."offer_price") AS max_id FROM "messages" WHERE "messages"."offer_id" = 83
---
    elsif sort_by == "Newest"
      @offers = Offer.where("offer_status=true").order("offers.offer_start_date asc")
    elsif sort_by == "Highest offer"
       @offers = Offer.where("offer_status=true").find(:all, :include => :messages).sort_by { |p| p.messages.maximum(:offer_price).to_i}.reverse