app/controllers/admin/offers_controller.rb

SELECT "artists".* FROM "artists" ORDER BY artist_name asc LIMIT 6 OFFSET 0
SELECT "offers".* FROM "offers" JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id ORDER BY lower(artists.artist_name) asc LIMIT 24 OFFSET 0
SELECT COUNT(*) FROM "artists"
SELECT COUNT(*) FROM "offers" WHERE (offer_end_date > '2013-06-20 09:47:39.056372') AND (offer_end_date < '2013-06-21 09:47:39.056661')
---
  def index
    # Offers
    session[:search_item] = ""
    session[:select] = ""
    session[:select_artists] = ""
    session[:search_artist_basic] = ""


    #logger.debug("bbbbbbbbbbbbbb")
    #logger.debug(params["buy_interesting_offers_sort_by"])
    if (params["buy_interesting_offers_sort_by"].nil? && params["show_active_offers_select"].nil? && params["offers_per_page_select"].nil?)

      @buy_interesting_offers = Offer.joins("JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id").order("lower(artists.artist_name) asc")
      @buy_interesting_offers = @buy_interesting_offers.paginate :page => params[:page] || 1, :per_page => 24

SELECT "offers".* FROM "offers" JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id JOIN artwork_descriptions ON artwork_descriptions.artwork_id = artworks.id JOIN artwork_titles ON artwork_titles.artwork_id = artworks.id WHERE (artwork_descriptions.artwork_description_en ilike '%%' OR
---
  def buy_art_search

    if (params[:offer].blank? && params["buy_interesting_offers_sort_by"].nil? && params["show_active_offers_select"].nil? && params["offers_per_page_select"].nil?)
      @buy_interesting_offers = Offer.joins("JOIN artworks ON offers.id = artworks.offer_id JOIN artists ON artworks.artist_id = artists.id").order("lower(artists.artist_name) asc")