app/views/admin/dashboard/_offer_data.html.haml

        = offer.artwork.artwork_title.artwork_title_en
      %p= "highest Offer: " "#{offer.messages.maximum(:offer_price)}"
---
SELECT MAX("messages"."offer_price") AS max_id FROM "messages" WHERE "messages"."offer_id" = 168

        = "views: 0"
        %p= "messages: " "#{offer.messages.count}"
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."offer_id" = 168