app/views/admin/dashboard/_sub_stats.html.haml

SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."subscription_plan_id" = 4 AND (subscription_confirmed = true AND free_subscription IS NOT true)
---
      %td.color2
        %p= (SubscriptionPlan.where(:id => 1).first.subscription_fee) * (@subscriptions.where("subscription_confirmed = true").where(:subscription_plan_id => 1).count)