app/views/admin/reports/_subscribers_locations.html.haml

        %p{:style=>"font-weight:bold; float:left; width:180px; margin:0px;"}=user.user_country
        %span= User.joins("LEFT OUTER JOIN subscriptions on users.id = subscriptions.user_id").where("users.user_country = '#{user.user_country}'").where("subscriptions.subscription_plan_id = 1").count
---
SELECT COUNT(*) FROM "users" LEFT OUTER JOIN subscriptions on users.id = subscriptions.user_id WHERE (users.user_country = 'Germany') AND (subscriptions.subscription_plan_id = 1)