app/views/admin/reports/_summary.html.haml

      %p{:style=>"font-weight:bold;"}="Paid Subscriptions"
      %span= Subscription.where("date(subscription_start_date) BETWEEN '#{@start_date}' AND '#{@end_date}'").where("subscription_confirmed = true AND free_subscription IS NOT true").where(:subscription_plan_id => 1).count
---
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."subscription_plan_id" = 1 AND (date(subscription_start_date) BETWEEN '2013-06-14' AND '2013-06-21') AND (auto_renewal = true AND subscription_renewal_date IS NULL)

      %span= Subscription.where("date(subscription_start_date) BETWEEN '#{@start_date}' AND '#{@end_date}'").where("subscription_confirmed = true AND free_subscription IS NOT true").where(:subscription_plan_id => 5).count
      %span= Subscription.where("date(subscription_start_date) BETWEEN '#{@start_date}' AND '#{@end_date}'").where("subscription_confirmed = true AND free_subscription IS NOT true").count
---
SELECT COUNT(*) FROM "subscriptions" WHERE (date(subscription_start_date) BETWEEN '2013-06-14' AND '2013-06-21') AND (subscription_confirmed = true AND free_subscription = true)