app/views/admin/layouts/_footer.html.haml

SELECT COUNT(*) FROM "offers" WHERE (offer_end_date > '2013-06-20 06:13:44.813864') AND (offer_end_date < '2013-06-21 06:13:44.814039')
---
				%br
				="New offers in last 24 hours :  #{Offer.where('created_at   > ?', 24.hours.ago).count}"

SELECT COUNT(*) FROM "subscriptions" WHERE (subscription_renewal_date > '2013-06-20 06:13:44.815499') AND (subscription_renewal_date < '2013-06-21 06:13:44.815648') AND (auto_renewal ='f')
---
				%br
				="New subscribers in the last 24 hours:  #{Subscription.where('created_at   > ?', 24.hours.ago).count}"

SELECT COUNT(*) FROM "artists" WHERE "artists"."approved_status" = 'f'
SELECT COUNT(*) FROM "message_admins"
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."subscription_confirmed" = 'f'
---
				%br
				=link_to "Unapproved artist names: #{Artist.where(:approved_status=>false).count}" , admin_admin_unknown_artist_path
				%br
				=link_to "Reported abuses: #{MessageAdmin.count}", admin_admin_path
				%br
				=link_to "Unpaid Subscriptions: #{Subscription.where(:subscription_confirmed => false).count}" , admin_admin_path

SELECT "offers".* FROM "offers" ORDER BY created_at DESC LIMIT 5
---
			%div{:style=>"align:center;"}
				-@offer = Offer.order('created_at DESC').limit(5).all

SELECT "forum_messages".* FROM "forum_messages" ORDER BY created_at DESC LIMIT 5
---
			%div
				-@message = ForumMessage.order('created_at DESC').limit(5).all